Revit 2027 API
Connector.Direction Property
 The direction of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FlowDirectionType Direction { get; }
Public ReadOnly Property Direction As FlowDirectionType
	Get
public:
property FlowDirectionType Direction {
	FlowDirectionType get ();
}
member Direction : FlowDirectionType with get
Property Value
FlowDirectionType
Exceptions
Exception | Condition
InvalidOperationException |  This connector does not support flow calculation and associated properties.
Remarks
 Instantaneous direction of this connector, calculated according to system.
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace